IDEA Open Model
LineSupportSegment.LocalCoordinateSystem Property
Compatible with IDEA StatiCa v 10.1
 Support local coord system
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public CoordSystem LocalCoordinateSystem { get; set; }
Public Property LocalCoordinateSystem As CoordSystem
	Get
	Set
public:
property CoordSystem^ LocalCoordinateSystem {
	CoordSystem^ get ();
	void set (CoordSystem^ value);
}
Property Value
Type: CoordSystem
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace